validation/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "i.*"
    {
        type            zeroGradient;
    }
    "o.*"
    {
        type            zeroGradient;
    }
    "building.*"
    {
        type            zeroGradient;
    }

    "ground.*"
    {
        type            zeroGradient;
    }
    "s.*"
    {
        type            slip;
        
    }
}


// ************************************************************************* //
