validation/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    "i.*"
    {
        type            zeroGradient;
    }
    "o.*"
    {
        type            fixedValue;
        value           uniform 0;
    }

    "building.*"
    {
        type            zeroGradient;
    }

    "ground.*"
    {
        type            zeroGradient;
    }
    "s.*"
    {
        type            slip;
        
    }
}

// ************************************************************************* //
